Revit 2026 API

# WallpaintApplicationType Enumeration

---

The enumerated type representing the permitted values for the asset property "WallpaintApplication" from the "WallPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum WallpaintApplicationType
```
```vb
Public Enumeration WallpaintApplicationType
```
```cpp
public enum class WallpaintApplicationType
```
```fsharp
type WallpaintApplicationType
```

| Member name | Value | Description |
| --- | --- | --- |
| Brush | 1 |  |
| Roller | 0 |  |
| Spray | 2 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace